<!DOCTYPE html>
<html lang="pt-BR">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="style.css">
    <link rel="stylesheet" href="historia.css">
    <title>Puddinzim</title>
</head>
<body>
    <header class="header">
        <img src="img/pudim.png" alt="pudim-logo" class="pudim-logo">
        <h1>Puddinzim</h1>
        <div class="pesquisa">
            <input type="text" class="search-input" placeholder="Pesquisar...">
            <button class="Search-button"><img src="img/search-icon.webp" alt="pesquisa-icon" class="search-icon"></button>
        </div>  
   
    </header>
    <nav>
        <table>
            <tr>
                <td><a href="inicio.html">Início</a></td>
                <td><a href="historia.html">História</a></td>
                <td><a href="sabores.html">Sabores</a></td>
                <td><a href="receitas.html">Receitas</a></td>
                <td><a href="cadastro.html">Cadastro</a></td>
            </tr>
        </table>
    </nav>
    <main>
      <h1>As Origens do Pudim</h1>
      <img src="img/pudim.avif" alt="pudim-image" class="pudim-image">

        <p>Voc&ecirc; sabia que o pudim, que &eacute; uma das sobremesas mais apreciadas no Brasil por ser muito f&aacute;cil e r&aacute;pido de se fazer, surgiu em forma de massa s&oacute;lida? Com a mistura de v&aacute;rios ingredientes que inclu&iacute;a farinha de trigo (como no Pudim de Yorkshire), sangue (pudim preto), ovos (pudim de p&atilde;o), ou uma mistura de gordura e farinha ou algum outro cereal (pudim de ameixa).&nbsp;</p>
        
        <p>Esses tipos de pudim podiam&nbsp; ser assados, cozidos ou fervidos. E ainda &eacute; comum em v&aacute;rios lugares, especialmente na Gr&atilde;-Bretanha, e pode ser o prato principal de uma refei&ccedil;&atilde;o ou sobremesa.</p>
        
        <p>Nos s&eacute;culos XVIII e XIX os pudins cozidos eram uma refei&ccedil;&atilde;o comum a bordo dos navios da Marinha Real, tinha gordura como base e as vers&otilde;es cozidas eram utilizadas como ra&ccedil;&atilde;o di&aacute;ria para os marinheiros.</p>
        
        <p>
        Muitos pudins de sobremesa desse tipo lembram bolos, mas s&atilde;o mais &uacute;midos e geralmente servidos em uma tigela, em vez de fatias, acompanhado de manjar ou sorvete. Na Austr&aacute;lia, h&aacute; o pudim de arroz e pudim de natal, e em tais casos a palavra &eacute; quase sempre qualificada com um adjetivo.</p>
        
        <p>
        Na Gr&atilde;-Bretanha e em alguns pa&iacute;ses da commonwealth, pudding significa apenas sobremesa.</p>
        
        <h2>O Pudim Doce:</h2>
        
        <p>
        Originada em Portugal, a sobremesa foi inventada por um abade portugu&ecirc;s. O abade n&atilde;o divulgava a receita, mas como a sobremesa acabou se tornando um grande sucesso diversos confeiteiros tentaram copi&aacute;-la.</p>
        
        <p>
        Ningu&eacute;m conseguia fazer um pudim como ele. Por&eacute;m, ap&oacute;s a sua morte os ingredientes secretos foram revelados: a&ccedil;&uacute;car; gemas; &aacute;gua e toucinho de porco faziam do Pudim de Priscos, o sucesso da culin&aacute;ria portuguesa.</p>
        
        <p>
        A receita se expandiu e o pudim agradou o paladar de muitos no mundo inteiro, e no Brasil se tornou uma sobremesa cl&aacute;ssica, presente em qualquer tipo de evento por ser uma sobremesa muito f&aacute;cil de fazer. Por se tornar extremamente popular, o pudim ganhou deriva&ccedil;&otilde;es com chocolate, frutas, p&atilde;o, sendo pudim de leite condensado o preferido dos brasileiros.</p>
    </main>
    <hr>
    <footer>
        <p>&copy; Puddingzim 2024
        <img src="img/whatsapp.png" alt="contact-icon">
        <img src="img/Instagram-icon.png" alt="contact-icon">
</body>
</html>